;-------------------------------------------------------------------------------------------
; Common Abilities
;-------------------------------------------------------------------------------------------

[Beags_Escalation_LightningReflexes X2AbilityTemplate]
LocFriendlyName="Lightning Reflexes"
LocLongDescription="The hit chance of reaction fire against this unit is reduced by 90 percent for the first shot, and by 70 percent for additional shots."
LocHelpText="The hit chance of reaction fire against this unit is reduced by 90 percent for the first shot, and by 70 percent for additional shots."
LocFlyOverText="Lightning Reflexes"
LocPromotionPopupText="The hit chance of reaction fire against this unit is reduced by 90 percent for the first shot, and by 70 percent for additional shots."

[Beags_Escalation_Opportunist X2AbilityTemplate]
LocFriendlyName="Opportunist"
LocLongDescription="Eliminates the Aim penalty on reaction shots, and allows reaction shots to cause critical hits."
LocHelpText="Eliminates the Aim penalty on reaction shots, and allows reaction shots to cause critical hits."
LocFlyOverText="Opportunist"
LocPromotionPopupText="<Bullet/> Eliminates the Aim penalty on reaction shots, and allows reaction shots to cause critical hits.<br/>"

[Beags_Escalation_SwordSliceNoCharge X2AbilityTemplate]
LocFriendlyName="Slash"
LocLongDescription="Attack any enemy within movement range with your sword."
LocHelpText="Attack any enemy within movement range with your sword."
LocFlyOverText="Slash"
LocPromotionPopupText="<Bullet/> You can trigger the Slash ability by placing the movement cursor over an enemy.<br/><Bullet/> You can only use a single action to move and trigger a Slash against an adjacent enemy.<br/>"

[Beags_Escalation_PistolStandardShot X2AbilityTemplate]
LocFriendlyName="Fire Pistol"
LocLongDescription="You have been trained to effectively utilize the full flexibility of a pistol as a complement to your sniper rifle."
LocHelpText="Fire your pistol at a target."
LocFlyOverText=""

[Beags_Escalation_Executioner X2AbilityTemplate]
LocFriendlyName="Executioner"
LocLongDescription="Confers +10 aim and +10 critical chance against targets at or below 50% health."
LocHelpText="Confers +10 aim and +10 critical chance against targets at or below 50% health."
LocFlyOverText="Executioner"
LocPromotionPopupText="Confers +10 aim and +10 critical chance against targets at or below 50% health."

[Beags_Escalation_Stealth X2AbilityTemplate]
LocFriendlyName="Conceal"
LocLongDescription="When the squad is revealed, this soldier remains concealed. Once per mission, immediately enter concealment."
LocHelpText="When the squad is revealed, this soldier remains concealed. Once per mission, immediately enter concealment."
LocFlyOverText="Conceal"
LocPromotionPopupText="<Bullet/> Even if the squad does not start a mission concealed, soldiers with Conceal will still begin the mission with concealment.<br/><Bullet/> If the soldier is the one that breaks squad concealment, then Conceal does not apply.<br/><Bullet/> Concealment can be entered at any location once per mission, but when done inside the detection radii of nearby enemies the Ranger will be revealed when flanked.<br/>"

[Beags_Escalation_LightningHandsPistol X2AbilityTemplate]
LocFriendlyName="Lightning Hands"
LocLongDescription="Fire your pistol at a target. This attack does not cost an action."
LocHelpText="Fire your pistol at a target. This attack does not cost an action."
LocFlyOverText="Lightning Hands"
LocPromotionPopupText="<Bullet/> 4 turn cooldown.<br/>"

[Beags_Escalation_LightningHandsSword X2AbilityTemplate]
LocFriendlyName="Lightning Hands"
LocLongDescription="Slash your sword at a target. This attack does not cost an action."
LocHelpText="Slash your sword at a target. This attack does not cost an action."
LocFlyOverText="Lightning Hands"
LocPromotionPopupText="<Bullet/> 4 turn cooldown.<br/>"

[Beags_Escalation_Flush X2AbilityTemplate]
LocFriendlyName="Flush"
LocLongDescription="Fire a shot that encourages enemies to move. The shot is easy to hit with (+30 aim), but does reduced damage (-50% base weapon damage). Uses 2 ammo."
LocHelpText="Fire a shot that encourages enemies to move. +30 aim. -50% base weapon damage. Uses 2 ammo."
LocFlyOverText="Flush"
LocPromotionPopupText="<Bullet/> +30 aim.<br/><Bullet/> -50% base weapon damage.<br/><Bullet/> Costs 2 ammo.<br/><Bullet/> Costs 2 ammo.<br/><Bullet/> Causes enemies to move."

[Beags_Escalation_HitAndRun X2AbilityTemplate]
LocFriendlyName="Hit and Run"
LocLongDescription="Your first attack of each turn against an uncovered or flanked target does not cost an action."
LocHelpText="Your first attack of each turn against an uncovered or flanked target does not cost an action."
LocFlyOverText="Hit and Run"
LocPromotionPopupText="<Bullet/> Your first attack of each turn against an uncovered or flanked target does not cost an action.<br/>"

[Beags_Escalation_SmokeAndMirrors X2AbilityTemplate]
LocFriendlyName="Smoke and Mirrors"
LocLongDescription="Allows one additional use of all equipped support grenades during each mission. It also increases charges from Smoke Grenade and Battle Scanner perks by 1."
LocHelpText="Allows one additional use of all equipped support grenades during each mission. It also increases charges from Smoke Grenade and Battle Scanner perks by 1."
LocFlyOverText="Smoke and Mirrors"
LocPromotionPopupText="<Bullet/> Allows one additional use of all equipped support grenades during each mission.<br/><Bullet/> Increases charges from Smoke Grenade and Battle Scanner perks by 1.<br/>"

[Beags_Escalation_Reaper X2AbilityTemplate]
LocFriendlyName="Reaper"
LocLongDescription="Your kills with a sword or pistol refund your action points for the turn."
LocHelpText="Your kills with a sword or pistol refund your action points for the turn."
LocFlyOverText="Reaper"
LocPromotionPopupText="<Bullet/> Your kills with a sword or pistol refund your action points for the turn.<br/>"

[Beags_Escalation_RapidReaction X2AbilityTemplate]
LocFriendlyName="Rapid Reaction"
LocLongDescription="If on Overwatch, confers a bonus reaction shot (to a maximum three shots total) for every reaction shot that is a hit."
LocHelpText="If on Overwatch, confers a bonus reaction shot (to a maximum three shots total) for every reaction shot that is a hit."
LocFlyOverText="Rapid Reaction"
LocPromotionPopupText="<Bullet/> If on Overwatch, confers a bonus reaction shot (to a maximum three shots total) for every reaction shot that is a hit.<br/>"

[Beags_Escalation_ReadyForAnything X2AbilityTemplate]
LocFriendlyName="Ready for Anything"
LocLongDescription="If you fire without taking any other costly action, you automatically enter Overwatch at the end of your turn."
LocHelpText="If you fire without taking any other costly action, you automatically enter Overwatch at the end of your turn."
LocFlyOverText="Ready for Anything"
LocPromotionPopupText="<Bullet/> If you fire without taking any other costly action, you automatically enter Overwatch at the end of your turn.<br/>"

[Beags_Escalation_DangerZone X2AbilityTemplate]
LocFriendlyName="Danger Zone"
LocLongDescription="Increases area of effect of Suppression and explosives."
LocHelpText="Increases area of effect of Suppression and explosives"
LocFlyOverText="Danger Zone"
LocPromotionPopupText="<Bullet/> +2 explosive radius.<br/><Bullet/> +3 suppression radius.<br/>"

[Beags_Escalation_DangerZoneSuppression X2AbilityTemplate]
LocFriendlyName="Suppression"
LocLongDescription="Fire a barrage that pins down targets in an area, granting reaction fire against them if they moves, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to the targets' aim."
LocHelpText="Penalize targets' aim and shoot them if they move."
LocFlyOverText="Suppression"
LocPromotionPopupText="<Bullet/> Suppression costs <Ability:SelfAmmoCost/> ammo points to use, but has no cooldown.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/>"

[Beags_Escalation_DoubleTap X2AbilityTemplate]
LocFriendlyName="Double Tap"
LocLongDescription="Allows you to perform an extra attack if you remain stationary for the turn. Does not include the use of grenades or rockets."
LocHelpText="Allows you to perform an extra attack if you remain stationary for the turn. Does not include the use of grenades or rockets."
LocFlyOverText="Double Tap"
LocPromotionPopupText="<Bullet/> Allows you to perform an extra attack if you remain stationary for the turn.<br/><Bullet/> Does not include the use of grenades or rockets.<br/><Bullet/> 2 turn cooldown.<br/>"

;-------------------------------------------------------------------------------------------
; Scout Abilities
;-------------------------------------------------------------------------------------------

[Beags_Escalation_Scout X2SoldierClassTemplate]
DisplayName="Scout"
ClassSummary="The Scout is a nimble yet powerful soldier who operates on the front lines. The Scout does reconnaissance and close-in combat work while relying on their skills at stealth and evasion for protection."
LeftAbilityTreeTitle="Pathfinder"
RightAbilityTreeTitle="Guerilla"

[Beags_Escalation_BattleScanner X2AbilityTemplate]
LocFriendlyName="Battle Scanner"
LocLongDescription="The Battle Scanner provides extra vision on the battlefield. Soldiers deploy it like a grenade, throwing it to a hidden area of the map that they want to reveal. Any hidden or disguised enemies will be revealed as well."
LocHelpText="The Battle Scanner provides extra vision on the battlefield. Soldiers deploy it like a grenade, throwing it to a hidden area of the map that they want to reveal. Any hidden or disguised enemies will be revealed as well."
LocFlyOverText="Battle Scanner"
LocPromotionPopupText="<Bullet/> Battle Scanners reveal an area hidden by the \"fog of war\" for multiple turns.\n<br/><Bullet/> Battle Scanners also reveal hidden or disguised enemies.<br/><Bullet/> 2 uses per mission."

[Beags_Escalation_Assassinate X2AbilityTemplate]
LocFriendlyName="Assassinate"
LocLongDescription="Your attacks will not break concealment if they kill their target."
LocHelpText="Your attacks will not break concealment if they kill their target."
LocFlyOverText="Assassinate"
LocPromotionPopupText="<Bullet/> Your attacks will not break concealment if they kill their target."

[Beags_Escalation_Awareness X2AbilityTemplate]
LocFriendlyName="Awareness"
LocLongDescription="The soldier pays close attention to their surroundings, detecting the presence of nearby enemies."
LocHelpText="The soldier pays close attention to their surroundings, detecting the presence of nearby enemies."
LocFlyOverText="Awareness"
LocPromotionPopupText="<Bullet/> Reveal the presence of nearby enemies.<br/><Bullet/> 10 tile radius.<br/>"

[Beags_Escalation_AwarenessPassive X2AbilityTemplate]
LocFriendlyName="Awareness"
LocLongDescription="The soldier listens very carefully, detecting the presence of nearby enemies."
LocHelpText="The soldier listens very carefully, detecting the presence of nearby enemies."
LocFlyOverText="Awareness"
LocPromotionPopupText="<Bullet/> Reveal the presence of nearby enemies.<br/><Bullet/> 10 tile radius.<br/>"

[Beags_Escalation_Ghost X2AbilityTemplate]
LocFriendlyName="Ghost"
LocLongDescription="Greatly reduces the Scout's detection radius by enemies while concealed."
LocHelpText="Greatly reduces the Scout's detection radius by enemies while concealed."
LocFlyOverText="Ghost"
LocPromotionPopupText="<Bullet/> Detection radius reduced by 50% whie concealed.<br/>"

[Beags_Escalation_Recon X2AbilityTemplate]
LocFriendlyName="Recon"
LocLongDescription="Gain +1 sight radius."
LocHelpText="Gain +1 sight radius."
LocFlyOverText="Recon"
LocPromotionPopupText="<Bullet/> +1 sight radius.<br/>"

[Beags_Escalation_Recon_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Scout SGT: Recon"
Summary="All soldiers are trained to be more observant of their surroundings.<br/><Bullet/> +1 sight radius.<br/>"

[Beags_Escalation_LowProfile X2AbilityTemplate]
LocFriendlyName="Low Profile"
LocLongDescription="Treat low cover as high cover."
LocHelpText="Treat low cover as high cover."
LocFlyOverText="Low Profile"
LocPromotionPopupText="<Bullet/> Treat low cover as high cover.<br/>"

[Beags_Escalation_LowProfile_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Scout: Low Profile"
Summary="No one goes to ground quite like the Scout.<br/><Bullet/> Treat low cover as high cover.<br/>"

;-------------------------------------------------------------------------------------------
; Rocketeer Abilities
;-------------------------------------------------------------------------------------------

[Beags_Escalation_Rocketeer X2SoldierClassTemplate]
DisplayName="Rocketeer"
ClassSummary="Rocketeers are heavy weapons units that support their team through the application of overwhelming heavy ordnance. The rockets they employ are an effective, if volatile, solution to the alien threat."
LeftAbilityTreeTitle="Tank Hunter"
RightAbilityTreeTitle="Rifleman AT"

[Beags_Escalation_LaunchRocket X2AbilityTemplate]
LocFriendlyName="Launch Rocket"
LocLongDescription="The Rocketeer uses a rocket launcher to fire rockets. This allows for delivering large explosive payloads at greater range."
LocHelpText="Launches the loaded rocket at target area."
LocFlyOverText="Launch Rocket"
LocPromotionPopupText="<Bullet/> The range of launched rockets can be further improved by upgrading to more advanced rocket launchers.<br/>"

[Beags_Escalation_ExtraHERocket X2AbilityTemplate]
LocFriendlyName="High Explosive Rocket"
LocLongDescription="The Rocketeer packs one High Explosive Rocket as standard equipment."
LocHelpText="The Rocketeer packs one High Explosive Rocket as standard equipment."
LocFlyOverText="High Explosive Rocket"
LocPromotionPopupText="<Bullet/> +1 extra High Explosive Rocket per mission.<br/>"

[Beags_Escalation_HEATWarheads X2AbilityTemplate]
LocFriendlyName="HEAT Warheads"
LocLongDescription="Your rocket attacks have +3 armor penetration (+6 with Advanced Explosives)."
LocHelpText="Your rocket attacks have +3 armor penetration (+6 with Advanced Explosives)."
LocFlyOverText="HEAT Warheads"
LocPromotionPopupText="<Bullet/> +3 armor penetration with basic rockets.<br/><Bullet/> +6 armor penetration with advanced rockets.<br/>"

[Beags_Escalation_FireInTheHole X2AbilityTemplate]
LocFriendlyName="Fire in the Hole"
LocLongDescription="Grants +10 aim and +3 range for rockets if the soldier has not moved this turn."
LocHelpText="Grants +10 aim and +3 range for rockets if the soldier has not moved this turn."
LocFlyOverText="Fire in the Hole"
LocPromotionPopupText="<Bullet/> +10 aim for rockets if stationary.<br/><Bullet/> +10 range for rockets if stationary.<br/>"

[Beags_Escalation_ExtraShredderRocket X2AbilityTemplate]
LocFriendlyName="Shredder Rocket"
LocLongDescription="The Rocketeer packs one Shredder Rocket as standard equipment."
LocHelpText="The Rocketeer packs one High Explosive Rocket as standard equipment."
LocFlyOverText="Shredder Rocket"
LocPromotionPopupText="<Bullet/> +1 extra Shredder Rocket per mission.<br/>"

[Beags_Escalation_JavelinRockets X2AbilityTemplate]
LocFriendlyName="Javelin Rockets"
LocLongDescription="Your rockets now travel 33% further."
LocHelpText="Your rockets now travel 33% further."
LocFlyOverText="Javelin Rockets"
LocPromotionPopupText="<Bullet/> Your rockets now travel 33% further.<br/>"

[Beags_Escalation_LaunchBunkerBuster X2AbilityTemplate]
LocFriendlyName="Launch Bunker Buster"
LocLongDescription="Launch a high payload H.E. Rocket with an increased blast radius. The Bunker Buster breaks through obstacles in its path before exploding at the point of impact."
LocHelpText="Launches the loaded Bunker Buster rocket at target area."
LocFlyOverText="Launch Bunker Buster"
LocPromotionPopupText="<Bullet/> Penetrates through walls and other obstacles.<br/><Bullet/> Large impact radius.<br/><Bullet/> 1 charge per mission.<br/>"

[Beags_Escalation_ExtraBunkerBuster X2AbilityTemplate]
LocFriendlyName="Bunker Buster"
LocLongDescription="The Rocketeer packs one high payload Bunker Buster rocket as standard equipment."
LocHelpText="The Rocketeer packs one high payload Bunker Buster rocket as standard equipment."
LocFlyOverText="Bunker Buster"
LocPromotionPopupText="<Bullet/> Penetrates and damages walls, units and other obstacles.<br/><Bullet/> Large impact radius.<br/>"

[Beags_Escalation_RocketSnapshot X2AbilityTemplate]
LocFriendlyName="Snapshot"
LocLongDescription="Reduces the aim penalty for launching a rocket after taking a costly action."
LocHelpText="Reduces the aim penalty for launching a rocket after taking a costly action."
LocFlyOverText="Snapshot"
LocPromotionPopupText="<Bullet/> -50% to the aim penalty for launching a rocket after taking a costly action.<br/>"

[Beags_Escalation_RocketSnapshot_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Rocketeer: Snapshot"
Summary="Reduces the aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> -50% to the aim penalty for launching a rocket after taking a costly action.<br/>"

[Beags_Escalation_WeaponsTeam X2AbilityTemplate]
LocFriendlyName="Weapons Team"
LocLongDescription="As a single action that ends a trooper’s turn, assist an adjacent Rocketeer, reducing their aim penalty for launching a rocket after taking a costly action."
LocHelpText="As a single action that ends a trooper’s turn, assist an adjacent Rocketeer, reducing their aim penalty for launching a rocket after taking a costly action."
LocFlyOverText="Weapons Team"
LocPromotionPopupText="As a single action that ends a trooper’s turn, assist an adjacent Rocketeer, reducing their aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> Lasts until the end of the turn or until the Rocketeer moves.<br/><Bullet/> -50% to the target's aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> Costs 1 action point and ends your turn.<br/>"

[Beags_Escalation_WeaponsTeam_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Rocketeer SGT: Weapons Team"
Summary="All soldiers may assist adjacent Rocketeers in steadying and aiming their weapon, reducing their aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> Lasts until the end of the turn or until the Rocketeer moves.<br/><Bullet/> -50% to the target's aim penalty for launching a rocket after taking a costly action.<br/><Bullet/> Costs 1 action point and ends your turn.<br/>"
